# Моя первая программа на Python
print('hello world!')
# Спрашиваем возразт у пользователя
name = input('Как вас зовут? ')
age = int(input('Сколько вам лет? '))
# Выводим сообщение с возрастом
if age >= 5:
    print(f'Привет, {name}, тебе {age} лет!')
else:
    print(f'Привет, малыш {name}, тебе {age} года!')
# f-строки позволяют вставлять переменные внутрь строк с помощью фигурных скобок {}
# В данном случае, мы используем f-строки для вывода приветствия с именем и возрастом пользователя.
# Давайте придумаем что-то более интересное, например, калькулятор возраста в собачьих годах
dog_years = age * 7
print(f'Если бы ты был собакой, тебе было бы {dog_years} лет!')
# Теперь мы можем узнать, сколько лет тебе будет через 10 лет
future_age = age + 10
print(f'Через 10 лет тебе будет {future_age} лет!')